<a href="https://colab.research.google.com/github/elvissounna/Colab_Training-/blob/main/Deep_Learning_Project_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:

import matplotlib.pyplot as plt 
%matplotlib inline

In [ ]:
df= pd.read_csv("https://raw.githubusercontent.com/patrickbrus/Birds_Classifier_API/master/data/Bird_Species_cleaned.csv")

In [ ]:
df.head()

                             filepaths                 labels data set
0  train\AFRICAN CROWNED CRANE\001.jpg  AFRICAN CROWNED CRANE    train
1  train\AFRICAN CROWNED CRANE\002.jpg  AFRICAN CROWNED CRANE    train
2  train\AFRICAN CROWNED CRANE\003.jpg  AFRICAN CROWNED CRANE    train
3  train\AFRICAN CROWNED CRANE\004.jpg  AFRICAN CROWNED CRANE    train
4  train\AFRICAN CROWNED CRANE\005.jpg  AFRICAN CROWNED CRANE    train

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 46622 entries, 0 to 46621
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   filepaths  46622 non-null  object
 1   labels     46622 non-null  object
 2   data set   46622 non-null  object
dtypes: object(3)
memory usage: 1.1+ MB

In [ ]:
#df.to_csv(r"sample_data/Bird_Species_cleaned.csv")

In [ ]:
df_classes = pd.read_csv ("class_dict.csv")
df_classes.head()

   class_index                  class  height  width  scale by
0            0  AFRICAN CROWNED CRANE     224    224         1
1            1      AFRICAN FIREFINCH     224    224         1
2            2              ALBATROSS     224    224         1
3            3   ALEXANDRINE PARAKEET     224    224         1
4            4        AMERICAN AVOCET     224    224         1

In [ ]:
# view the number of classes in data set df_classes
print (f"There are {df_classes.shape[0]} classes in the df_classes Data Set")

There are 300 classes in the df_classes Data Set

In [ ]:
#Add class index in df Data Set.
df["class_index"] = (
                    [df_classes[df_classes["class"] == 
                                                df["labels"][i]]["class_index"].to_numpy()[0] 
                                                 for i in range(df.shape[0])]
                    )

In [ ]:
df_classes.head()

   class_index                  class  height  width  scale by
0            0  AFRICAN CROWNED CRANE     224    224         1
1            1      AFRICAN FIREFINCH     224    224         1
2            2              ALBATROSS     224    224         1
3            3   ALEXANDRINE PARAKEET     224    224         1
4            4        AMERICAN AVOCET     224    224         1

In [ ]:
df.head()

                             filepaths  ... class_index
0  train\AFRICAN CROWNED CRANE\001.jpg  ...           0
1  train\AFRICAN CROWNED CRANE\002.jpg  ...           0
2  train\AFRICAN CROWNED CRANE\003.jpg  ...           0
3  train\AFRICAN CROWNED CRANE\004.jpg  ...           0
4  train\AFRICAN CROWNED CRANE\005.jpg  ...           0

[5 rows x 4 columns]

In [ ]:
#check how many train, test and validation samples are in the Data Set df.

df["data set"].value_counts()

train    43622
test      1500
valid     1500
Name: data set, dtype: int64

In [ ]:
#Split df to train, test and validation Data Frame
df_train = df[df["data set"]== "train"]
df_val = df[df["data set"]== "valid"]
df_test = df[df["data set"]== "test"]

In [ ]:
#Chech if shapes match with the result oof values_counts

print (f"There are {df_train.shape[0]} images in the training set.")
print (f"There are {df_val.shape[0]} images in the validation sat.")
print (f"There are {df_test.shape[0]} images in the test set.")

In [ ]:
#je sauvegarde quelque chose pour voir si ça fonctionne.